{
    "opening:text": {
        "slides": [
            1
        ],
        "template_id": 1,
        "content_schema": {
            "main title": {
                "description": "main title of the slide",
                "type": "text",
                "data": [
                    "Tourism & Culture:"
                ]
            },
            "subtitle": {
                "description": "subtitle or main topic of the slide",
                "type": "text",
                "data": [
                    "APPRECIATING THE TANGIBLE & THE INTANGIBLE OF BHUBANESWAR THROUGH CULTURAL TOURISM"
                ]
            },
            "author": {
                "description": "author of the presentation",
                "type": "text",
                "data": [
                    "By Ayona Bhaduri"
                ]
            }
        }
    },
    "table of contents:text": {
        "slides": [
            2,
            3,
            4
        ],
        "template_id": 4,
        "content_schema": {
            "main title": {
                "description": "main title of the slide",
                "type": "text",
                "data": [
                    "What do we mean by Cultural Tourism?"
                ]
            },
            "content paragraph": {
                "description": "detailed explanation of the concept",
                "type": "text",
                "data": [
                    "Cultural Tourism is the subset of tourism concerned with a particular country or region’s culture, specifically the lifestyle of the people in those geographical areas, the history of those people, their art and craft, their language and literature, their architecture, their religion, and all other elements that have helped shape their way of life."
                ]
            },
            "content bullets": {
                "description": "key points or statements in a specific color",
                "type": "text",
                "data": [
                    "Every race has something essential to contribute to the world’s civilisation in the course of its own self-expression and self-realisation.",
                    "And the essential contribution of India is simply her Indianness.",
                    "All that India has to offer to the world proceeds from her philosophy.",
                    "That this philosophy has held India together and seen her through many upheavals – political, social, economic, intellectual, is brought to the fore when Max Muller, the famous scholar and Orientalist, remarks, ‘There is, in fact, an unbroken continuity between the most modern and the most ancient phases of Hindu thought, extending over more than three thousand years.’"
                ]
            }
        }
    },
    "transition:text": {
        "slides": [
            5,
            6,
            13
        ],
        "template_id": 13,
        "content_schema": {
            "main content": {
                "description": "main content of the slide, presenting a detailed explanation of the practice of Indian classical dance and its spiritual and metaphysical aspects",
                "type": "text",
                "data": [
                    "The practice of Indian classical dance, like meditation, tames and purifies the external Sthula-Sharira (the body composed of fluid, with humours and saps, as also of the bones, muscles and vital vulnerable junctures) as it quiets and balances the body’s three humours (tridosha, tridhaatu) – wind (vata), phlegm (kapha) and fire (pitta). Eventually the dancer should begin to discover the Suksma Sharira (the subtle, metaphysical interior body) within her which articulates the psycho-spiritual experiences similar to those of the yogi and the pilgrim or devotee visiting the temple. This subtle body, most often identified with Kundalini Yoga, is defined by one of the many scholars as “ an invisible mandala formed by a combination of symbolic (but also very real) geometric figures” and often depicted as a microcosm of the universe, with the Shiva Samhita noting, “All the beings that exist in the three worlds are also to be found in the subtle body”. Rightly, it is called the seat of the Atma or soul.  And the discovery of this subtle body is made possible by the awakening of the vital Kundalini energy within the dancer’s body through the practise and performance of the Odissi repertoire wherein the dancer begins with Mangalacharan, an invocation at the entrance to the temple, proceeds to circumambulate the temple structure depicting the exquisite physical beauty of the numerous postures in various bhangi-s sculpted on the temple walls through Batu, then advancing through the Natya Mandapa with the joyous Pallavi, enters the Garbha griha with the self-reflective Abhinaya, an Ashatapadi wherein she is in private conversation with her Lord, finally leading to Moshya Nata, the dance of liberation. Thus, the repertoire leads the dancer from collective external consciousness to singular internal consciousness such that in Mokshya Nata a moment of absolute peace and stillness is reached when the dancer is in total union while in movement with her Atma or soul within.  "
                ]
            }
        }
    },
    "transition:image": {
        "slides": [
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "template_id": 12,
        "content_schema": {
            "main title": {
                "description": "main title of the slide",
                "type": "text",
                "data": [
                    "The Connecting Link"
                ]
            },
            "content bullets": {
                "description": "detailed explanations and concepts related to the topic",
                "type": "text",
                "data": [
                    "In India the ultimate temple, since times ancient, has always been the human body.",
                    "The Hindu temple is perceived as a link between man and God, between the earthly life and the divine life, between the actual and the ideal.",
                    "The origin of all the classical dances of India has been the Hindu temple; it is in the temple that they were conceived and nourished and it is in the temple itself that they acquired their full stature. Fostered by religion, they continue to be an intrinsic part of worship in the temples even today.",
                    "The intangible, born and nurtured in the tangible that is built on the metaphysical plan of the cosmic intangible, contains within it, the entire structure of the tangible itself. Neither without the other.",
                    "Thus, the dancer, while in the dance akin to yoga, seeks the sacred temple within."
                ]
            },
            "main image": {
                "description": "diagram comparing the structure of a Hindu temple and the human body",
                "type": "image",
                "data": [
                    "Diagram: Comparison between the structure of a Hindu temple and the human body, using labeled illustrations and proportions. Main features include chakra symbols on the body and corresponding parts of the temple."
                ]
            }
        }
    },
    "ending:text": {
        "slides": [
            14
        ],
        "template_id": 14,
        "content_schema": {
            "main title": {
                "description": "main title of the slide, prominently displayed",
                "type": "text",
                "data": [
                    "ODISSI DANCER – A Global Ambassador of cultural heritage of Odisha"
                ]
            },
            "content paragraphs": {
                "description": "detailed content paragraphs of the slide, providing in-depth information",
                "type": "text",
                "data": [
                    "Kelucharan Mahapatra’s artistic journey touches every key aspect of the cultural life of Odisha",
                    "Be it the traditional expertise of the Chitrakars, or the entertaining art forms of Gotipua and Jatra parties, or the Ras Leela performances soaked in bhakti, or the innovations attempted at the Annapurna Theatre Groups, all these experiences, acquired not through formal training but through a continuous interaction with life, contributed richly to his understanding and creation of the Odissi form.",
                    "And it is the magnanimous presence and personality of this great Guru, his detailed teaching and in depth insights into the entire panorama of Odia culture, that have drawn dancers from across the world to his door to learn his art from him, and continue to attract many more",
                    "So we see that through Odissi, Kelu Babu was able to not only take Oriya culture to the world but he also succeeded in bringing the world to Odisha to appreciate her rich intangible heritage."
                ]
            }
        }
    },
    "functional_keys": [
        "opening:text",
        "table of contents:text",
        "transition:text",
        "transition:image",
        "ending:text"
    ]
}
